{
  "Banded Chlorosis": {
    "hindi_name": "बैंडेड क्लोरोसिस",
    "cause": "Iron or zinc deficiency leading to yellow stripes",
    "cause_hindi": "लौह या जिंक की कमी के कारण पीली धारियां",
    "organic_treatment": [
      "मिट्टी में अच्छी तरह सड़ी हुई गोबर की खाद डालें।",
      "पत्तियों पर केलेटेड आयरन या जिंक का जैविक घोल स्प्रे करें।"
    ],
    "chemical_treatment": [
      "मिट्टी में फेरस सल्फेट (आयरन के लिए) या जिंक सल्फेट का प्रयोग करें।",
      "पत्तियों पर सूक्ष्म पोषक तत्वों के मिश्रण का छिड़काव करें।"
    ],
    "preventive_measures": [
      "रोपण से पहले मिट्टी का परीक्षण कराएं।",
      "मिट्टी का पीएच स्तर सही बनाए रखें (6.0 से 7.0)।",
      "संतुलित उर्वरक का प्रयोग सुनिश्चित करें।"
    ]
  },
  "Brown Spot": {
    "hindi_name": "भूरा धब्बा",
    "cause": "Caused by fungal infection",
    "cause_hindi": "फफूंदी के संक्रमण से होता है",
    "organic_treatment": [
      "नीम के तेल का घोल बनाकर छिड़काव करें।",
      "संक्रमित पत्तियों को हटाकर नष्ट कर दें।"
    ],
    "chemical_treatment": [
      "प्रोपिकोनाज़ोल या मैनकोज़ेब युक्त फफूंदनाशक का प्रयोग करें।",
      "मौसम की स्थिति के आधार पर नियमित अंतराल पर छिड़काव करें।"
    ],
    "preventive_measures": [
      "खेत में हवा का संचार सुधारने के लिए गन्ने की उचित दूरी बनाए रखें।",
      "जलभराव से बचें और उचित जल निकासी सुनिश्चित करें।",
      "रोग प्रतिरोधी किस्मों का चयन करें।"
    ]
  },
  "BrownRust": {
    "hindi_name": "भूरी रस्ट",
    "cause": "Caused by Puccinia melanocephala",
    "cause_hindi": "Puccinia melanocephala फफूंदी से होता है",
    "organic_treatment": [
      "जैविक सल्फर आधारित फफूंदनाशक का छिड़काव करें।",
      "संक्रमित पत्तियों को इकट्ठा करके जला दें।"
    ],
    "chemical_treatment": [
      "प्रोपिकोनाज़ोल या ट्रायज़ोल समूह के फफूंदनाशक का छिड़काव करें।",
      "रोग के पहले लक्षण दिखते ही छिड़काव शुरू करें।"
    ],
    "preventive_measures": [
      "रस्ट रोग के प्रति प्रतिरोधी किस्मों का प्रयोग करें।",
      "अत्यधिक नाइट्रोजन उर्वरक के प्रयोग से बचें।",
      "खेत की सफाई रखें।"
    ]
  },
  "Dried Leaves": {
    "hindi_name": "सूखी पत्तियां",
    "cause": "Lack of water or disease stress",
    "cause_hindi": "पानी की कमी या रोग का तनाव",
    "organic_treatment": [
      "सिंचाई की आवृत्ति और मात्रा बढ़ाएं।",
      "मिट्टी में नमी बनाए रखने के लिए जैविक मल्च का प्रयोग करें।"
    ],
    "chemical_treatment": [
      "यदि किसी पोषक तत्व की कमी है, तो उसका उर्वरक डालें।",
      "सीधा कोई रासायनिक उपचार नहीं है, मूल कारण का पता लगाना होगा।"
    ],
    "preventive_measures": [
      "सिंचाई और पोषण आपूर्ति को बेहतर करें।",
      "नियमित रूप से मिट्टी की नमी की जाँच करें।",
      "पौधों को किसी भी तनाव से बचाने के लिए समय पर देखभाल करें।"
    ]
  },
  "Grassy shoot": {
    "hindi_name": "घास जैसा अंकुर",
    "cause": "Caused by phytoplasma infection",
    "cause_hindi": "फाइटोप्लाज्मा संक्रमण से होता है",
    "organic_treatment": [
      "इस रोग का कोई जैविक उपचार नहीं है।",
      "फोकस केवल रोकथाम पर होना चाहिए।"
    ],
    "chemical_treatment": [
      "इस रोग का कोई रासायनिक उपचार नहीं है।",
      "रोग फैलाने वाले कीड़ों को नियंत्रित करने के लिए कीटनाशकों का प्रयोग करें।"
    ],
    "preventive_measures": [
      "रोपण से पहले बीज सेट्स पर गर्म पानी (50°C पर 2 घंटे) से उपचार करें।",
      "केवल रोग मुक्त, स्वस्थ बीज सेट्स का उपयोग करें।",
      "संक्रमित पौधों को खेत से उखाड़कर तुरंत नष्ट कर दें।"
    ]
  },
  "Healthy Leaves": {
    "hindi_name": "स्वस्थ पत्तियां",
    "cause": "No disease detected",
    "cause_hindi": "कोई रोग नहीं पाया गया",
    "organic_treatment": [
      "जैविक खाद का प्रयोग करके मिट्टी की उर्वरता बनाए रखें।",
      "समय-समय पर नीम के तेल का हल्का स्प्रे कीटों को दूर रखता है।"
    ],
    "chemical_treatment": [
      "कोई उपचार आवश्यक नहीं है।",
      "आवश्यकतानुसार संतुलित उर्वरक का प्रयोग करें।"
    ],
    "preventive_measures": [
      "नियमित सिंचाई और उचित पोषण दें।",
      "खेत को खरपतवार से मुक्त रखें।",
      "समय पर कटाई करें।"
    ]
  },
  "Pokkah Boeng": {
    "hindi_name": "पोक्का बोएंग",
    "cause": "Caused by Fusarium species",
    "cause_hindi": "Fusarium प्रजातियों से होता है",
    "organic_treatment": [
      "संक्रमित ऊपरी हिस्से को काटकर हटा दें।",
      "ट्राइकोडर्मा युक्त जैविक फफूंदनाशक का प्रयोग करें।"
    ],
    "chemical_treatment": [
      "कॉपर ऑक्सीक्लोराइड या मैनकोज़ेब का छिड़काव करें।",
      "रोग के शुरुआती चरण में ही छिड़काव करना प्रभावी होता है।"
    ],
    "preventive_measures": [
      "रोग के प्रति प्रतिरोधी किस्मों का चयन करें।",
      "खेत में उचित जल निकासी सुनिश्चित करें।",
      "संतुलित मात्रा में उर्वरकों का प्रयोग करें।"
    ]
  },
  "Sett Rot": {
    "hindi_name": "सेट रॉट",
    "cause": "Caused by Ceratocystis paradoxa",
    "cause_hindi": "Ceratocystis paradoxa फफूंदी से होता है",
    "organic_treatment": [
      "रोपण से पहले बीज सेट्स को ट्राइकोडर्मा के घोल में डुबोएं।",
      "अच्छी तरह सड़ी हुई गोबर की खाद का प्रयोग करें।"
    ],
    "chemical_treatment": [
      "रोपण से पहले बीज सेट्स को कार्बेन्डाजिम या किसी अन्य फफूंदनाशक के घोल से उपचारित करें।",
      "खेत में फफूंदनाशक का छिड़काव करें।"
    ],
    "preventive_measures": [
      "हमेशा स्वस्थ और रोग मुक्त बीज सेट्स का प्रयोग करें।",
      "कटाई के बाद खेत की गहरी जुताई करें।",
      "जलभराव वाली भूमि में गन्ने की खेती से बचें।"
    ]
  },
  "smut": {
    "hindi_name": "स्मट रोग",
    "cause": "Caused by fungus Sporisorium scitamineum",
    "cause_hindi": "Sporisorium scitamineum फफूंदी से होता है",
    "organic_treatment": [
      "इस रोग का कोई प्रभावी जैविक नियंत्रण नहीं है।",
      "रोकथाम ही मुख्य उपाय है।"
    ],
    "chemical_treatment": [
      "रोपण से पहले बीज सेट्स को फफूंदनाशक से उपचारित करें।",
      "संक्रमित पौधों को हटाने के बाद आसपास फफूंदनाशक का छिड़काव करें।"
    ],
    "preventive_measures": [
      "बीज सेट्स का गर्म पानी (52°C पर 30 मिनट) से उपचार करें।",
      "स्मट रोग के प्रति प्रतिरोधी किस्मों का प्रयोग करें।",
      "संक्रमित पौधों को बहुत सावधानी से, प्लास्टिक की थैली में बंद करके खेत से हटाएं और जला दें।"
    ]
  },
  "Viral Disease": {
    "hindi_name": "वायरल रोग",
    "cause": "Various virus infections",
    "cause_hindi": "विभिन्न वायरस संक्रमण",
    "organic_treatment": [
      "वायरस का कोई सीधा जैविक उपचार नहीं है।",
      "वायरस फैलाने वाले कीड़ों को नियंत्रित करने के लिए नीम के तेल का छिड़काव करें।"
    ],
    "chemical_treatment": [
      "वायरस का कोई सीधा रासायनिक उपचार नहीं है।",
      "वायरस फैलाने वाले कीड़ों (जैसे एफिड्स) को नियंत्रित करने के लिए प्रणालीगत कीटनाशकों का उपयोग करें।"
    ],
    "preventive_measures": [
      "संक्रमित पौधों को तुरंत खेत से हटाकर नष्ट कर दें।",
      "हमेशा वायरस-मुक्त प्रमाणित बीज सेट्स का उपयोग करें।",
      "खेत में काम आने वाले उपकरणों को साफ रखें।"
    ]
  },
  "Yellow Leaf": {
    "hindi_name": "पीली पत्ती",
    "cause": "Deficiency or yellow leaf virus",
    "cause_hindi": "पोषक तत्वों की कमी या पीली पत्ती वायरस",
    "organic_treatment": [
      "यदि कमी के कारण है, तो जैविक खाद और कम्पोस्ट डालें।",
      "यदि वायरस के कारण है, तो कीड़ों को नियंत्रित करने के लिए नीम तेल स्प्रे करें।"
    ],
    "chemical_treatment": [
      "यदि कमी के कारण है, तो मैग्नीशियम, सल्फर और आयरन युक्त उर्वरक डालें।",
      "यदि वायरस के कारण है, तो कीड़ों को नियंत्रित करने के लिए कीटनाशक का प्रयोग करें।"
    ],
    "preventive_measures": [
      "संतुलित उर्वरक का प्रयोग सुनिश्चित करें।",
      "रोग फैलाने वाले कीड़ों पर नियंत्रण रखें।",
      "अच्छी जल निकासी वाली मिट्टी में रोपण करें।"
    ]
  },
  "Red Stripe(viral Disease)": {
    "hindi_name": "लाल धारी रोग",
    "cause": "Caused by Sugarcane mosaic virus or related viral pathogens",
    "cause_hindi": "शुगरकेन मोज़ेक वायरस या संबंधित वायरल रोगजनकों के कारण होता है",
    "organic_treatment": [
        "इस रोग का कोई निश्चित जैविक उपचार नहीं है।",
        "रोग फैलाने वाले कीड़ों (जैसे एफिड्स) को नियंत्रित करने के लिए जैविक कीटनाशक (नीम तेल, नीम आधारित स्प्रे) का प्रयोग करें।"
    ],
    "chemical_treatment": [
        "इस रोग का कोई सीधा रासायनिक उपचार उपलब्ध नहीं है।",
        "कीटनाशकों का प्रयोग करके रोग फैलाने वाले कीड़ों को नियंत्रित करें।"
    ],
    "preventive_measures": [
        "केवल रोगमुक्त और प्रमाणित बीज सेट्स का उपयोग करें।",
        "संक्रमित पौधों को खेत से उखाड़कर तुरंत नष्ट कर दें।",
        "कीट वाहकों (एफिड्स) की निगरानी और नियंत्रण करें।",
        "फसल में संतुलित उर्वरक का प्रयोग करें ताकि पौधों की रोग प्रतिरोधक क्षमता बनी रहे।"
    ]
}

}